#+TITLE: Emacs Configuration

** gnus

Sanitized version of .authinfo.gpg for Gmail IMAP and SMTP.

#+begin_src sh :results output
gpg --batch -d ~/.authinfo.gpg | awk '/\.gmail\.com/{$4="EMAIL";$6="PASSWORD";print}'
#+end_src

#+RESULTS:
: machine imap.gmail.com login EMAIL password PASSWORD port imaps
: machine smtp.gmail.com login EMAIL password PASSWORD port 587

#+begin_src sh :results output
pass show imap.gmail.com | sed -e '1s/.*/PASSWORD/' -e '/user:/s/[^ ]*$/EMAIL/'
#+end_src

#+RESULTS:
: PASSWORD
: user: EMAIL
: port: imaps

#+begin_src sh :results output
pass show smtp.gmail.com | sed -e '1s/.*/PASSWORD/' -e '/user:/s/[^ ]*$/EMAIL/'
#+end_src

#+RESULTS:
: PASSWORD
: user: EMAIL
: port: smtp

#+begin_src emacs-lisp
(use-package gnus
  :config
  ;; Use secondary-select-methods
  (setq gnus-select-method '(nnnil ""))

  ;; ;; Gmane
  (add-to-list 'gnus-secondary-select-methods
               '(nntp "news.gmane.org"))

  ;; Fastmail
  (add-to-list 'gnus-secondary-select-methods
               '(nnimap "imap.fastmail.com"))
  ;; Gmail
  (add-to-list 'gnus-secondary-select-methods
               '(nnimap "imap.gmail.com"))

  ;; (add-to-list 'gnus-secondary-select-methods
  ;;              '(nnimap "imap.gmail.com"
  ;;                       (nnimap-address "imap.gmail.com")
  ;;                       ;; (nnimap-server-port 993)
  ;;                       ;; (nnimap-stream ssl)
  ;;                       ))

  ;; ;; Record all IMAP commands in the ‘"*imap log*"’
  ;; (setq nnimap-record-commands t)

  ;; Skip prompt: "Gnus auto-save file exists. Do you want to read it?"
  (setq gnus-always-read-dribble-file t
        ;; Mark sent messages as read
        gnus-gcc-mark-as-read t
        gnus-inhibit-startup-message t
        ;; Do not take over the entire frame
        gnus-use-full-window nil))
#+end_src

** ob-go

#+begin_src go
package main

import "fmt"

func main() {
	fmt.Println("Hello, world")
}
#+end_src

#+RESULTS:
: Hello, world

#+begin_src emacs-lisp
(use-package ob-go)
#+end_src

** ob-rust

Requires cargo-script.

#+begin_src sh
cargo install cargo-script
#+end_src

#+begin_src rust
fn main() {
    for count in 0..3 {
        println!("{}. Hello World!", count);
    }
}
#+end_src

#+RESULTS:
: 0. Hello World!
: 1. Hello World!
: 2. Hello World!

#+begin_src emacs-lisp
(use-package ob-rust)
#+end_src

